voyons si j aurais survecu dans le titanic

In [1]:
import numpy as np
from scipy import ndimage
import matplotlib.pyplot as plt
import pandas as pd

data=pd.read_excel(r'C:\Users\HP\Downloads\titanic3.xls')
data.shape # nbre de ligne et colonne

(1309, 14)

In [2]:
#data.columns #caffiche les colonne
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

eliminer les collonne qu on veut pas

In [3]:
data = data.drop(['name', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],axis=1) # pour eliminer les colonnes inutiles

In [4]:
data.describe() #produit les statistique de base pour chaque colonne

            pclass     survived          age
count  1309.000000  1309.000000  1046.000000
mean      2.294882     0.381971    29.881135
std       0.837836     0.486055    14.413500
min       1.000000     0.000000     0.166700
25%       2.000000     0.000000    21.000000
50%       3.000000     0.000000    28.000000
75%       3.000000     1.000000    39.000000
max       3.000000     1.000000    80.000000

In [5]:
data.columns

Index(['pclass', 'survived', 'sex', 'age'], dtype='object')

on peux voir ici pclass et survived on le meme nombre par contre age non ce qui sous entend qu il manque certaine

donner donc ici la meilleur facon de coriger cela et  de soit remplacer par des elements par defaut (data.fillna(data['age'].mean()) ou supprimer (data=data.dropna(axis=0)) ces ligne

In [6]:
data=data.dropna(axis=0)

In [7]:
data.shape

(1046, 4)

In [8]:
data.describe()

            pclass     survived          age
count  1046.000000  1046.000000  1046.000000
mean      2.207457     0.408222    29.881135
std       0.841497     0.491740    14.413500
min       1.000000     0.000000     0.166700
25%       1.000000     0.000000    21.000000
50%       2.000000     0.000000    28.000000
75%       3.000000     1.000000    39.000000
max       3.000000     1.000000    80.000000

In [9]:
data.head() # affiche les elements du fichier

   pclass  survived     sex      age
0       1         1  female  29.0000
1       1         1    male   0.9167
2       1         0  female   2.0000
3       1         0    male  30.0000
4       1         0  female  25.0000

In [10]:
data['pclass'].value_counts() #comment savoir le nbre de passagé qui etais en 1er ou 2eme ,.. pclass

pclass
3    501
1    284
2    261
Name: count, dtype: int64

In [11]:
data.groupby(['sex','pclass']).mean()  # on regroupe par le sex et la pclass et on calcule la moyen

               survived        age
sex    pclass
female 1       0.962406  37.037594
       2       0.893204  27.499191
       3       0.473684  22.185307
male   1       0.350993  41.029250
       2       0.145570  30.815401
       3       0.169054  25.962273

In [12]:
#data = data.set_index('name') #cv changer les index pour que les index soit les noms

In [13]:
data[data['age'] < 18 ]['pclass'].value_counts() # pour  les passagé mineurs

pclass
3    106
2     33
1     15
Name: count, dtype: int64

In [14]:
data[data['age'] < 18 ].groupby(['sex','pclass']).mean() # on regroupe le sex des passageé de moin de 18an donc on peux voir que 87% des femme de moin de 18 on suirvrcu et ...

               survived        age
sex    pclass
female 1       0.875000  14.125000
       2       1.000000   8.273150
       3       0.543478   8.416667
male   1       0.857143   9.845243
       2       0.733333   6.222220
       3       0.233333   9.838888